package principal;

/**
 * Mejora el ejercicio anterior añadiéndole colores.
 */
public class S01Ejercicio10 {

    public static void main(String[] args) {
        System.out.println(" +-──-+-──-+-──-+-──-+-──-+-──-+-──-+-──-+");
        System.out.println(" | \u001B[31m\u265C\u001B[37m | \u001B[31m\u265E\u001B[37m | \u001B[31m\u265D\u001B[37m | \u001B[31m\u265B\u001B[37m | \u001B[31m\u265A\u001B[37m | \u001B[31m\u265D\u001B[37m | \u001B[31m\u265E\u001B[37m | \u001B[31m\u265C\u001B[37m |");
        System.out.println(" +-──-+-──-+-──-+-──-+-──-+-──-+-──-+-──-+");
        System.out.println(" | \u001B[31m\u265F\u001B[37m | \u001B[31m\u265F\u001B[37m | \u001B[31m\u265F\u001B[37m | \u001B[31m\u265F\u001B[37m | \u001B[31m\u265F\u001B[37m | \u001B[31m\u265F\u001B[37m | \u001B[31m\u265F\u001B[37m | \u001B[31m\u265F\u001B[37m |");
        System.out.println(" +-──-+-──-+-──-+-──-+-──-+-──-+-──-+-──-+");
        System.out.println(" |\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|");
        System.out.println(" +-──-+-──-+-──-+-──-+-──-+-──-+-──-+-──-+");
        System.out.println(" |\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|");
        System.out.println(" +-──-+-──-+-──-+-──-+-──-+-──-+-──-+-──-+");
        System.out.println(" |\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|");
        System.out.println(" +-──-+-──-+-──-+-──-+-──-+-──-+-──-+-──-+");
        System.out.println(" |\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|\u2003\u202F\u2003|");
        System.out.println(" +-──-+-──-+-──-+-──-+-──-+-──-+-──-+-──-+");
        System.out.println(" | \u001B[33m\u265F\u001B[37m | \u001B[33m\u265F\u001B[37m | \u001B[33m\u265F\u001B[37m | \u001B[33m\u265F\u001B[37m | \u001B[33m\u265F\u001B[37m | \u001B[33m\u265F\u001B[37m | \u001B[33m\u265F\u001B[37m | \u001B[33m\u265F\u001B[37m |");
        System.out.println(" +-──-+-──-+-──-+-──-+-──-+-──-+-──-+-──-+");
        System.out.println(" | \u001B[33m\u265C\u001B[37m | \u001B[33m\u265E\u001B[37m | \u001B[33m\u265D\u001B[37m | \u001B[33m\u265B\u001B[37m | \u001B[33m\u265A\u001B[37m | \u001B[33m\u265D\u001B[37m | \u001B[33m\u265E\u001B[37m | \u001B[33m\u265C\u001B[37m |");
        System.out.println(" +-──-+-──-+-──-+-──-+-──-+-──-+-──-+-──-+");

    } // Fin main

} // Fin class
